Repository: tsurumi-yizhou/fire-box
Catalog: windows/App/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, zh_cn

# TrayIconTooltip
source: FireBox AI Gateway
fr_fr: Passerelle IA FireBox
zh_cn: FireBox AI 网关

# TrayMenuOpen
source: Open FireBox
fr_fr: Ouvrir FireBox
zh_cn: 打开 FireBox

# TrayMenuQuit
source: Quit
fr_fr: Quitter
zh_cn: 退出

# NavDashboard.Content
source: Dashboard
fr_fr: Tableau de bord
zh_cn: 仪表盘

# NavConnections.Content
source: Connections
fr_fr: Connexions
zh_cn: 连接

# NavProviders.Content
source: Providers
fr_fr: Fournisseurs
zh_cn: 提供商

# NavRoutes.Content
source: Routes
zh_cn: 路由

# NavAllowlist.Content
source: Allowlist
fr_fr: Liste autorisée
zh_cn: 允许列表

# DashboardStatus.Text
source: Status:
fr_fr: Statut :
zh_cn: 状态：

# DashboardTotalRequests.Text
source: Total Requests
fr_fr: Total des requêtes
zh_cn: 总请求数

# DashboardFailedRequests.Text
source: Failed Requests
fr_fr: Requêtes échouées
zh_cn: 失败请求

# DashboardPromptTokens.Text
source: Prompt Tokens
fr_fr: Tokens d'invite
zh_cn: 提示词 Token

# DashboardCompletionTokens.Text
source: Completion Tokens
fr_fr: Tokens de complétion
zh_cn: 完成 Token

# DashboardTotalCost.Text
source: Total Cost (USD)
fr_fr: Coût total (USD)
zh_cn: 总成本 (USD)

# DashboardAvgLatency.Text
source: Avg Latency (ms)
fr_fr: Latence moyenne (ms)
zh_cn: 平均延迟 (ms)

# DashboardActiveConnections.Text
source: Active Connections
fr_fr: Connexions actives
zh_cn: 活动连接

# DashboardStatusLoading
source: Loading…
fr_fr: Chargement…
zh_cn: 加载中…

# DashboardStatusConnected
source: Connected
fr_fr: Connecté
zh_cn: 已连接

# DashboardStatusUnavailable
source: Service unavailable
fr_fr: Service indisponible
zh_cn: 服务不可用

# ConnectionsTitle.Text
source: Active Connections
fr_fr: Connexions actives
zh_cn: 活动连接

# ConnectionsRefresh.Content
source: Refresh
fr_fr: Actualiser
zh_cn: 刷新

# ConnectionsColumnClient.Text
source: Client
zh_cn: 客户端

# ConnectionsColumnRequests.Text
source: Requests
fr_fr: Requêtes
zh_cn: 请求数

# ConnectionsColumnAppPath.Text
source: App Path
fr_fr: Chemin de l'application
zh_cn: 应用路径

# ProvidersTitle.Text
source: Providers
fr_fr: Fournisseurs
zh_cn: 提供商

# ProvidersAddApiKey.Content
source: Add API Key
fr_fr: Ajouter une clé API
zh_cn: 添加 API 密钥

# ProvidersAddOAuth.Content
source: Add OAuth
fr_fr: Ajouter OAuth
zh_cn: 添加 OAuth

# ProvidersAddLocal.Content
source: Add Local
fr_fr: Ajouter un modèle local
zh_cn: 添加本地模型

# ProvidersColumnName.Text
source: Name
fr_fr: Nom
zh_cn: 名称

# ProvidersColumnType.Text
source: Type
zh_cn: 类型

# ProvidersColumnBaseUrl.Text
source: Base URL
fr_fr: URL de base
zh_cn: 基础 URL

# ProvidersDelete.Content
source: Delete
fr_fr: Supprimer
zh_cn: 删除

# AddApiKeyDialogTitle
source: Add API Key Provider
fr_fr: Ajouter un fournisseur de clé API
zh_cn: 添加 API 密钥提供商

# AddApiKeyDialogNameLabel.Text
source: Name
fr_fr: Nom
zh_cn: 名称

# AddApiKeyDialogNamePlaceholder
source: Name
fr_fr: Nom
zh_cn: 名称

# AddApiKeyDialogTypeLabel.Text
source: Provider type
fr_fr: Type de fournisseur
zh_cn: 提供商类型

# AddApiKeyDialogKeyLabel.Text
source: API Key
fr_fr: Clé API
zh_cn: API 密钥

# AddApiKeyDialogKeyPlaceholder
source: API Key
fr_fr: Clé API
zh_cn: API 密钥

# AddApiKeyDialogUrlLabel.Text
source: Base URL (optional)
fr_fr: URL de base (optionnel)
zh_cn: 基础 URL（可选）

# AddApiKeyDialogUrlPlaceholder
source: Base URL (optional)
fr_fr: URL de base (optionnel)
zh_cn: 基础 URL（可选）

# AddApiKeyDialogPrimaryButton
source: Add
fr_fr: Ajouter
zh_cn: 添加

# AddApiKeyDialogCloseButton
source: Cancel
fr_fr: Annuler
zh_cn: 取消

# AddOAuthDialogTitle
source: Add OAuth Provider
fr_fr: Ajouter un fournisseur OAuth
zh_cn: 添加 OAuth 提供商

# AddOAuthDialogStep2Title
source: Authorize in Browser
fr_fr: Autoriser dans le navigateur
zh_cn: 在浏览器中授权

# AddOAuthDialogPrimaryButton
source: Start
fr_fr: Démarrer
zh_cn: 开始

# AddOAuthDialogStep2PrimaryButton
source: I've Authorized
fr_fr: J'ai autorisé
zh_cn: 我已授权

# AddOAuthDialogHintFormat
source: Visit {0} and enter the code above.\nCode expires in {1} minutes.
fr_fr: Visitez {0} et entrez le code ci-dessus. Le code expire dans {1} minutes.
zh_cn: 访问 {0} 并输入上面的代码。\n代码将在 {1} 分钟后过期。

# AddLocalDialogTitle
source: Add Local Model
fr_fr: Ajouter un modèle local
zh_cn: 添加本地模型

# AddLocalDialogPathLabel.Text
source: Model path
fr_fr: Chemin du modèle
zh_cn: 模型路径

# AddLocalDialogPathPlaceholder
source: Model path (e.g. C:\models\llama-3.gguf)
fr_fr: Chemin du modèle (ex: C:\models\llama-3.gguf)
zh_cn: 模型路径（例如 C:\models\llama-3.gguf）

# AddLocalDialogPrimaryButton
source: Add
fr_fr: Ajouter
zh_cn: 添加

# DeleteProviderDialogTitle
source: Delete Provider
fr_fr: Supprimer le fournisseur
zh_cn: 删除提供商

# DeleteProviderDialogContent
source: Are you sure you want to delete this provider?
fr_fr: Êtes-vous sûr de vouloir supprimer ce fournisseur ?
zh_cn: 确定要删除此提供商吗？

# DeleteProviderDialogPrimaryButton
source: Delete
fr_fr: Supprimer
zh_cn: 删除

# DeleteProviderDialogCloseButton
source: Cancel
fr_fr: Annuler
zh_cn: 取消

# RoutesTitle.Text
source: Route Rules
fr_fr: Règles de routage
zh_cn: 路由规则

# RoutesAdd.Content
source: Add Route
fr_fr: Ajouter une route
zh_cn: 添加路由

# RoutesRefresh.Content
source: Refresh
fr_fr: Actualiser
zh_cn: 刷新

# RoutesColumnVirtualModelId.Text
source: Virtual Model ID
fr_fr: ID du modèle virtuel
zh_cn: 虚拟模型 ID

# RoutesColumnStrategy.Text
source: Strategy
fr_fr: Stratégie
zh_cn: 策略

# RoutesColumnDisplayName.Text
source: Display Name
fr_fr: Nom d'affichage
zh_cn: 显示名称

# RoutesDelete.Content
source: Delete
fr_fr: Supprimer
zh_cn: 删除

# AddRouteDialogTitle
source: Add Route Rule
fr_fr: Ajouter une règle de routage
zh_cn: 添加路由规则

# AddRouteDialogVirtualModelIdLabel.Text
source: Virtual Model ID
fr_fr: ID du modèle virtuel
zh_cn: 虚拟模型 ID

# AddRouteDialogVirtualModelIdPlaceholder
source: e.g. gpt-4
fr_fr: ex: gpt-4
zh_cn: 例如 gpt-4

# AddRouteDialogDisplayNameLabel.Text
source: Display Name
fr_fr: Nom d'affichage
zh_cn: 显示名称

# AddRouteDialogDisplayNamePlaceholder
source: e.g. GPT-4 Turbo
fr_fr: ex: GPT-4 Turbo
zh_cn: 例如 GPT-4 Turbo

# AddRouteDialogStrategyLabel.Text
source: Strategy
fr_fr: Stratégie
zh_cn: 策略

# AddRouteDialogTargetProviderLabel.Text
source: Target Provider ID
fr_fr: ID du fournisseur cible
zh_cn: 目标提供商 ID

# AddRouteDialogTargetProviderPlaceholder
source: Provider ID
fr_fr: ID du fournisseur
zh_cn: 提供商 ID

# AddRouteDialogTargetModelLabel.Text
source: Target Model ID
fr_fr: ID du modèle cible
zh_cn: 目标模型 ID

# AddRouteDialogTargetModelPlaceholder
source: Model ID (e.g. gpt-4-turbo)
fr_fr: ID du modèle (ex: gpt-4-turbo)
zh_cn: 模型 ID（例如 gpt-4-turbo）

# AddRouteDialogPrimaryButton
source: Save
fr_fr: Enregistrer
zh_cn: 保存

# AddRouteDialogCloseButton
source: Cancel
fr_fr: Annuler
zh_cn: 取消

# DeleteRouteDialogTitle
source: Delete Route
fr_fr: Supprimer la route
zh_cn: 删除路由

# DeleteRouteDialogContentFormat
source: Delete route "{0}"?
fr_fr: Supprimer la route "{0}" ?
zh_cn: 删除路由 "{0}"？

# DeleteRouteDialogPrimaryButton
source: Delete
fr_fr: Supprimer
zh_cn: 删除

# DeleteRouteDialogCloseButton
source: Cancel
fr_fr: Annuler
zh_cn: 取消

# AllowlistTitle.Text
source: Allowed Applications
fr_fr: Applications autorisées
zh_cn: 已允许的应用

# AllowlistRefresh.Content
source: Refresh
fr_fr: Actualiser
zh_cn: 刷新

# AllowlistColumnDisplayName.Text
source: Display Name
fr_fr: Nom d'affichage
zh_cn: 显示名称

# AllowlistColumnAppPath.Text
source: App Path
fr_fr: Chemin de l'application
zh_cn: 应用路径

# AllowlistRevoke.Content
source: Revoke
fr_fr: Révoquer
zh_cn: 撤销

# RevokeAccessDialogTitle
source: Revoke Access
fr_fr: Révoquer l'accès
zh_cn: 撤销访问权限

# RevokeAccessDialogContentFormat
source: Remove "{0}" from the allowlist?
fr_fr: Retirer "{0}" de la liste autorisée ?
zh_cn: 从允许列表中移除 "{0}"？

# RevokeAccessDialogPrimaryButton
source: Revoke
fr_fr: Révoquer
zh_cn: 撤销

# RevokeAccessDialogCloseButton
source: Cancel
fr_fr: Annuler
zh_cn: 取消

# ErrorDialogTitle
source: Error
fr_fr: Erreur
zh_cn: 错误

# ErrorDialogCloseButton
source: OK
zh_cn: 确定
